NordicSemiconductor/nRF5-SDK-for-Mesh/mesh/serial/src/serial_handler_mesh.c
        case NRF_MESH_EVT_KEY_REFRESH_NOTIFICATION:
            status = serial_packet_buffer_get(SERIAL_PACKET_LENGTH_OVERHEAD + sizeof(serial_evt_mesh_key_refresh_t), &p_serial_evt);
            if (status == NRF_SUCCESS)
            {
                p_serial_evt->opcode = SERIAL_OPCODE_EVT_MESH_KEY_REFRESH_NOTIFICATION;
                p_serial_evt->payload.evt.mesh.key_refresh.netkey_index = p_evt->params.key_refresh.subnet_index;
                p_serial_evt->payload.evt.mesh.key_refresh.phase = p_evt->params.key_refresh.phase;
                serial_tx(p_serial_evt);
            }
            break;

        default:
            break;
    }
}

/*****************************************************************************
* Interface functions
*****************************************************************************/
void serial_handler_mesh_init(void)
{
    m_evt_handler.evt_cb = serial_handler_mesh_evt_handle;
    nrf_mesh_evt_handler_add(&m_evt_handler);
}

void serial_handler_mesh_rx(const serial_packet_t* p_cmd)
{
    NRF_MESH_ASSERT(p_cmd->opcode >= SERIAL_OPCODE_CMD_RANGE_MESH_START &&
                    p_cmd->opcode <= SERIAL_OPCODE_CMD_RANGE_MESH_END);
    if (p_cmd->opcode >= SERIAL_OPCODE_CMD_RANGE_MESH_START + (sizeof(m_handlers) / sizeof(mesh_serial_cmd_handler_t)))
    {
        serial_cmd_rsp_send(p_cmd->opcode, SERIAL_STATUS_ERROR_CMD_UNKNOWN, NULL, 0);
    }
    else
    {
        const mesh_serial_cmd_handler_t * p_handler = &m_handlers[p_cmd->opcode - SERIAL_OPCODE_CMD_RANGE_MESH_START];

        /* Make sure our handler array is up to date. */
        NRF_MESH_ASSERT(p_cmd->opcode == p_handler->opcode);

        if (p_cmd->length < SERIAL_PACKET_LENGTH_OVERHEAD + p_handler->min_param_length ||
            p_cmd->length > SERIAL_PACKET_LENGTH_OVERHEAD + p_handler->min_param_length + p_handler->optional_extra_bytes)
        {
            serial_cmd_rsp_send(p_cmd->opcode, SERIAL_STATUS_ERROR_INVALID_LENGTH, NULL, 0);
        }
        else
        {
            p_handler->handler_cb(p_cmd);
        }
    }
}
